---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.HasRisers
source: html/80526e1c-bfa5-643d-5b59-72b7390c51de.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.HasRisers Property

True if the stairs run will include risers on steps, false otherwise.

## Syntax (C#)
```csharp
public bool HasRisers { get; set; }
```